# https://stepik.org/lesson/761760/step/3?auth=login&unit=763882

# Создайте пустой словарь и сохраните его в переменную my_dict, затем выведите на экран эту переменную
my_dict = {}
print(my_dict)
